apache/nuttx/arch/arm/src/common/stm32/stm32_comp_m3m4_v2.c
/****************************************************************************
 * arch/arm/src/common/stm32/stm32_comp_m3m4_v2.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <errno.h>
#include <assert.h>

#include <nuttx/analog/comp.h>
#include <nuttx/analog/ioctl.h>
#include <nuttx/debug.h>

#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "stm32_comp.h"
#include "stm32_gpio.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Some COMP peripheral must be enabled and the device must be supported */

#define DEVICE_NOT_SUPPORTED

#if defined(CONFIG_STM32_COMP)

#ifndef CONFIG_STM32_SYSCFG
#  error "SYSCFG clock enable must be set"
#endif

#if defined(CONFIG_STM32_STM32G43XX)
#  undef DEVICE_NOT_SUPPORTED
#  if defined(CONFIG_STM32_COMP5) || defined(CONFIG_STM32_COMP6) || \
      defined(CONFIG_STM32_COMP7)
#    error "STM32G43XX supports only COMP1, COMP2, COMP3 and COMP4"
#  endif
#endif

#if defined(DEVICE_NOT_SUPPORTED)
#  error "Device not supported"
#endif

#if defined(CONFIG_STM32_COMP1_OUT) || defined(CONFIG_STM32_COMP2_OUT) || \
    defined(CONFIG_STM32_COMP3_OUT) || defined(CONFIG_STM32_COMP4_OUT) || \
    defined(CONFIG_STM32_COMP5_OUT) || defined(CONFIG_STM32_COMP6_OUT) || \
    defined(CONFIG_STM32_COMP7_OUT)
#  define COMP_OUT_GPIO
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* This structure describes the configuration of one COMP device */

struct stm32_comp_s
{
  uint8_t inm;                  /* Inverting input selection */
  uint32_t gpio_inm;            /* Inverting input pin */
  uint8_t inp;                  /* Non inverting input selection */
  uint32_t gpio_inp;            /* Non-inverting input pin */
  uint8_t pol;                  /* Output polarity */
  uint8_t hyst;                 /* Comparator hysteresis */
  uint8_t blanking;             /* Blanking source */
  uint8_t lock;                 /* Comparator Lock */
  uint32_t csr;                 /* Control and status register */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* COMP Register access */

static inline void     comp_modify_csr(struct stm32_comp_s *priv,
                                       uint32_t clearbits, uint32_t setbits);
static inline uint32_t comp_getreg_csr(struct stm32_comp_s *priv);
static inline void     comp_putreg_csr(struct stm32_comp_s *priv,
                                       uint32_t value);

/* COMP Driver Methods */

#if defined (CONFIG_COMP)
static void comp_shutdown(struct comp_dev_s *dev);
static int  comp_setup(struct comp_dev_s *dev);
static int  comp_read(struct comp_dev_s *dev);
static int  comp_ioctl(struct comp_dev_s *dev, int cmd,
                       unsigned long arg);
#endif

static int  comp_config(struct stm32_comp_s *priv);
static int  comp_enable(struct stm32_comp_s *priv, bool enable);
static bool comp_lock_get(struct stm32_comp_s *priv);
static int  comp_lock_set(struct stm32_comp_s *priv, bool lock);

static int  comp_config_inmpin(struct stm32_comp_s *priv);
static int  comp_config_inppin(struct stm32_comp_s *priv);
#if defined(COMP_OUT_GPIO)
static int  comp_config_outpin(struct stm32_comp_s *priv);
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

#ifdef CONFIG_COMP
static const struct comp_ops_s g_compops =
{
  .ao_shutdown  = comp_shutdown,
  .ao_setup     = comp_setup,
  .ao_read      = comp_read,
  .ao_ioctl     = comp_ioctl,
};
#endif

#ifdef CONFIG_STM32_COMP1
static struct stm32_comp_s g_comp1priv =
{
  .inm       = CONFIG_STM32_COMP1_INM,
  .inp       = CONFIG_STM32_COMP1_INP,
  .pol       = CONFIG_STM32_COMP1_POL,
  .hyst      = CONFIG_STM32_COMP1_HYST,
  .blanking  = CONFIG_STM32_COMP1_BLANKSEL,
  .lock      = CONFIG_STM32_COMP1_LOCK,
  .gpio_inp  = GPIO_COMP1_INP,
  .csr       = STM32_COMP1_CSR
};

static struct comp_dev_s g_comp1dev =
{
#ifdef CONFIG_COMP
  .ad_ops  = &g_compops,
#endif
  .ad_priv = &g_comp1priv,
};
#endif

#ifdef CONFIG_STM32_COMP2
static struct stm32_comp_s g_comp2priv =
{
  .inm       = CONFIG_STM32_COMP2_INM,
  .inp       = CONFIG_STM32_COMP2_INP,
  .pol       = CONFIG_STM32_COMP2_POL,
  .hyst      = CONFIG_STM32_COMP2_HYST,
  .blanking  = CONFIG_STM32_COMP2_BLANKSEL,
  .lock      = CONFIG_STM32_COMP2_LOCK,
  .gpio_inp  = GPIO_COMP2_INP,
  .csr       = STM32_COMP2_CSR
};

static struct comp_dev_s g_comp2dev =
{
#ifdef CONFIG_COMP
  .ad_ops  = &g_compops,
#endif
  .ad_priv = &g_comp2priv,
};
#endif

#ifdef CONFIG_STM32_COMP3
static struct stm32_comp_s g_comp3priv =
{
  .inm       = CONFIG_STM32_COMP3_INM,
  .inp       = CONFIG_STM32_COMP3_INP,
  .pol       = CONFIG_STM32_COMP3_POL,
  .hyst      = CONFIG_STM32_COMP3_HYST,
  .blanking  = CONFIG_STM32_COMP3_BLANKSEL,
  .lock      = CONFIG_STM32_COMP3_LOCK,
  .gpio_inp  = GPIO_COMP3_INP,
  .csr       = STM32_COMP3_CSR
};

