apache/nuttx/arch/arm/src/common/stm32/stm32_comp_m3m4_v2.c
static struct comp_dev_s g_comp3dev =
{
#ifdef CONFIG_COMP
  .ad_ops  = &g_compops,
#endif
  .ad_priv = &g_comp3priv,
};
#endif

#ifdef CONFIG_STM32_COMP4
static struct stm32_comp_s g_comp4priv =
{
  .inm       = CONFIG_STM32_COMP4_INM,
  .inp       = CONFIG_STM32_COMP4_INP,
  .pol       = CONFIG_STM32_COMP4_POL,
  .hyst      = CONFIG_STM32_COMP4_HYST,
  .blanking  = CONFIG_STM32_COMP4_BLANKSEL,
  .lock      = CONFIG_STM32_COMP4_LOCK,
  .gpio_inp  = GPIO_COMP4_INP,
  .csr       = STM32_COMP4_CSR
};

static struct comp_dev_s g_comp4dev =
{
#ifdef CONFIG_COMP
  .ad_ops  = &g_compops,
#endif
  .ad_priv = &g_comp4priv,
};
#endif

#ifdef CONFIG_STM32_COMP5
static struct stm32_comp_s g_comp5priv =
{
  .inm       = CONFIG_STM32_COMP5_INM,
  .inp       = CONFIG_STM32_COMP5_INP,
  .pol       = CONFIG_STM32_COMP5_POL,
  .hyst      = CONFIG_STM32_COMP5_HYST,
  .blanking  = CONFIG_STM32_COMP5_BLANKSEL,
  .lock      = CONFIG_STM32_COMP5_LOCK,
  .gpio_inp  = GPIO_COMP5_INP,
  .csr       = STM32_COMP5_CSR
};

static struct comp_dev_s g_comp5dev =
{
#ifdef CONFIG_COMP
  .ad_ops  = &g_compops,
#endif
  .ad_priv = &g_comp5priv,
};
#endif

#ifdef CONFIG_STM32_COMP6
static struct stm32_comp_s g_comp6priv =
{
  .inm       = CONFIG_STM32_COMP6_INM,
  .inp       = CONFIG_STM32_COMP6_INP,
  .pol       = CONFIG_STM32_COMP6_POL,
  .hyst      = CONFIG_STM32_COMP6_HYST,
  .blanking  = CONFIG_STM32_COMP6_BLANKSEL,
  .lock      = CONFIG_STM32_COMP6_LOCK,
  .gpio_inp  = GPIO_COMP6_INP,
  .csr       = STM32_COMP6_CSR
};

static struct comp_dev_s g_comp6dev =
{
#ifdef CONFIG_COMP
  .ad_ops  = &g_compops,
#endif
  .ad_priv = &g_comp6priv,
};
#endif

#ifdef CONFIG_STM32_COMP7
static struct stm32_comp_s g_comp7priv =
{
  .inm       = CONFIG_STM32_COMP7_INM,
  .inp       = CONFIG_STM32_COMP7_INP,
  .pol       = CONFIG_STM32_COMP7_POL,
  .hyst      = CONFIG_STM32_COMP7_HYST,
  .blanking  = CONFIG_STM32_COMP7_BLANKSEL,
  .lock      = CONFIG_STM32_COMP7_LOCK,
  .gpio_inp  = GPIO_COMP7_INP,
  .csr       = STM32_COMP7_CSR
};

static struct comp_dev_s g_comp7dev =
{
#ifdef CONFIG_COMP
  .ad_ops  = &g_compops,
#endif
  .ad_priv = &g_comp7priv,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: comp_modify_csr
 *
 * Description:
 *   Modify the value of a 32-bit COMP CSR register (not atomic).
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *   clrbits - The bits to clear
 *   setbits - The bits to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void comp_modify_csr(struct stm32_comp_s *priv,
                                   uint32_t clearbits, uint32_t setbits)
{
  uint32_t csr = priv->csr;

  modifyreg32(csr, clearbits, setbits);
}

/****************************************************************************
 * Name: comp_getreg_csr
 *
 * Description:
 *   Read the value of an COMP CSR register
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *
 * Returned Value:
 *   The current contents of the COMP CSR register
 *
 ****************************************************************************/

static inline uint32_t comp_getreg_csr(struct stm32_comp_s *priv)
{
  uint32_t csr = priv->csr;

  return getreg32(csr);
}

/****************************************************************************
 * Name: comp_putreg_csr
 *
 * Description:
 *   Write a value to an COMP register.
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *   value  - The value to write to the COMP CSR register
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void comp_putreg_csr(struct stm32_comp_s *priv,
                                   uint32_t value)
{
  uint32_t csr = priv->csr;

  putreg32(value, csr);
}

/****************************************************************************
 * Name: comp_lock_get
 *
 * Description:
 *   Get COMP lock bit state
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *
 * Returned Value:
 *   True if COMP locked, false if not locked
 *
 ****************************************************************************/

static bool comp_lock_get(struct stm32_comp_s *priv)
{
  uint32_t regval;

  regval = comp_getreg_csr(priv);

  return (((regval & COMP_CSR_LOCK) == 0) ? false : true);
}

/****************************************************************************
 * Name: comp_lock_set
 *
 * Description:
 *   Lock comparator CSR register
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *   enable - lock flag
 *
 * Returned Value:
 *  0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int comp_lock_set(struct stm32_comp_s *priv, bool lock)
{
  if (comp_lock_get(priv))
    {
      if (lock == false)
        {
          aerr("ERROR: COMP LOCK can be cleared only by a system reset\n");

          return -EPERM;
        }
    }
  else
    {
      if (lock == true)
        {
          comp_modify_csr(priv, 0, COMP_CSR_LOCK);

          priv->lock = 1;
        }
    }

  return OK;
}

/****************************************************************************
 * Name: comp_config_inmpin
 *
 * Description:
 *   Configure comparator inverting input pin. The GPIO that COMPx inverting
 *   input will be assigned is dependent of comparator number and must be
 *   defined in board.h file. See table 196 in RM0440.
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *
 * Returned Value:
 *  0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int comp_config_inmpin(struct stm32_comp_s *priv)
{
#  if defined(CONFIG_STM32_COMP1)
  if (priv->csr == STM32_COMP1_CSR)
    {
      stm32_configgpio(GPIO_COMP1_INM);
    }
#  endif

#  if defined(CONFIG_STM32_COMP2)
  if (priv->csr == STM32_COMP2_CSR)
    {
      stm32_configgpio(GPIO_COMP2_INM);
    }
#  endif

#  if defined(CONFIG_STM32_COMP3)
  if (priv->csr == STM32_COMP3_CSR)
    {
      stm32_configgpio(GPIO_COMP3_INM);
    }
#  endif

