apache/nuttx/arch/arm/src/common/stm32/stm32_comp_m3m4_v2.c
#  if defined(CONFIG_STM32_COMP4)
  if (priv->csr == STM32_COMP4_CSR)
    {
      stm32_configgpio(GPIO_COMP4_INM);
    }
#  endif

#  if defined(CONFIG_STM32_COMP5)
  if (priv->csr == STM32_COMP5_CSR)
    {
      stm32_configgpio(GPIO_COMP5_INM);
    }
#  endif

#  if defined(CONFIG_STM32_COMP6)
  if (priv->csr == STM32_COMP6_CSR)
    {
      stm32_configgpio(GPIO_COMP6_INM);
    }
#  endif

#  if defined(CONFIG_STM32_COMP7)
  if (priv->csr == STM32_COMP7_CSR)
    {
      stm32_configgpio(GPIO_COMP7_INM);
    }
#  endif

  return OK;
}

/****************************************************************************
 * Name: comp_config_inppin
 *
 * Description:
 *   Configure comparator non-inverting input pin. The IO pin that COMPx
 *   non-inverting input will be assigned is dependent of comparator number
 *   and must be defined in board.h file.
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *
 * Returned Value:
 *  0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int comp_config_inppin(struct stm32_comp_s *priv)
{
#  if defined(CONFIG_STM32_COMP1)
  if (priv->csr == STM32_COMP1_CSR)
    {
      stm32_configgpio(GPIO_COMP1_INP);
    }
#  endif

#  if defined(CONFIG_STM32_COMP2)
  if (priv->csr == STM32_COMP2_CSR)
    {
      stm32_configgpio(GPIO_COMP2_INP);
    }
#  endif

#  if defined(CONFIG_STM32_COMP3)
  if (priv->csr == STM32_COMP3_CSR)
    {
      stm32_configgpio(GPIO_COMP3_INP);
    }
#  endif

#  if defined(CONFIG_STM32_COMP4)
  if (priv->csr == STM32_COMP4_CSR)
    {
      stm32_configgpio(GPIO_COMP4_INP);
    }
#  endif

#  if defined(CONFIG_STM32_COMP5)
  if (priv->csr == STM32_COMP5_CSR)
    {
      stm32_configgpio(GPIO_COMP5_INP);
    }
#  endif

#  if defined(CONFIG_STM32_COMP6)
  if (priv->csr == STM32_COMP6_CSR)
    {
      stm32_configgpio(GPIO_COMP6_INP);
    }
#  endif

#  if defined(CONFIG_STM32_COMP7)
  if (priv->csr == STM32_COMP7_CSR)
    {
      stm32_configgpio(GPIO_COMP7_INP);
    }
#  endif

  return OK;
}

/****************************************************************************
 * Name: comp_config_outpin
 *
 * Description:
 *   Configure comparator output GPIO pin.
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *
 * Returned Value:
 *  0 on success, a negated errno value on failure
 *
 ****************************************************************************/

#if defined(COMP_OUT_GPIO)
static int comp_config_outpin(struct stm32_comp_s *priv)
{
#  if defined(CONFIG_STM32_COMP1_OUT)
  if (priv->csr == STM32_COMP1_CSR)
    {
      stm32_configgpio(GPIO_COMP1_OUT);
    }
#  endif

#  if defined(CONFIG_STM32_COMP2_OUT)
  if (priv->csr == STM32_COMP2_CSR)
    {
      ainfo("\tOUT assigned to: GPIO\n");
      stm32_configgpio(GPIO_COMP2_OUT);
    }
#  endif

#  if defined(CONFIG_STM32_COMP3_OUT)
  if (priv->csr == STM32_COMP3_CSR)
    {
      stm32_configgpio(GPIO_COMP3_OUT);
    }
#  endif

#  if defined(CONFIG_STM32_COMP4_OUT)
  if (priv->csr == STM32_COMP4_CSR)
    {
      stm32_configgpio(GPIO_COMP4_OUT);
    }
#  endif

#  if defined(CONFIG_STM32_COMP5_OUT)
  if (priv->csr == STM32_COMP5_CSR)
    {
      stm32_configgpio(GPIO_COMP5_OUT);
    }
#  endif

#  if defined(CONFIG_STM32_COMP6_OUT)
  if (priv->csr == STM32_COMP6_CSR)
    {
      stm32_configgpio(GPIO_COMP6_OUT);
    }
#  endif

#  if defined(CONFIG_STM32_COMP7_OUT)
  if (priv->csr == STM32_COMP7_CSR)
    {
      stm32_configgpio(GPIO_COMP7_OUT);
    }
#  endif

  return OK;
}
#endif /* COMP_OUT_GPIO */

/****************************************************************************
 * Name: comp_config
 *
 * Description:
 *   Configure comparator and used I/Os. The pin configuration and the input
 *   assignments are COMP index dependent.
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *
 * Returned Value:
 *  0 on success, a negated errno value on failure
 *
 * REVISIT: Where to config comparator output pin ?
 *
 ****************************************************************************/

static int comp_config(struct stm32_comp_s *priv)
{
  uint32_t regval = 0;
  uint32_t value = 0;

  /* Configure COMPx inverting input. */

  value = priv->inm << COMP_CSR_INMSEL_SHIFT;

  switch (priv->inm)
    {
      case COMP_INM_1_4_VREF:
      case COMP_INM_1_2_VREF:
      case COMP_INM_3_4_VREF:

        value |= COMP_CSR_BRGEN;    /* scaler resistor bridge enable */

      case COMP_INM_VREF:

        value |= COMP_CSR_SCALEN;    /* VREFINT scaler enable */
        break;

      case COMP_INM_DAC_1:
      case COMP_INM_DAC_2:

        break;

      case COMP_INM_PIN_1:
      case COMP_INM_PIN_2:

        comp_config_inmpin(priv);
        break;

      default:
        return -EINVAL;
    }

  regval |= value;

  /* Configure COMPx non-inverting input. */

  ainfo("\tINP assigned to GPIO%d\n", priv->inp);

  value = priv->inp << COMP_CSR_INPSEL_SHIFT;
  regval |= value;

  comp_config_inppin(priv);

  /* Configure COMPx polarity */

  if (priv->pol == COMP_POL_INVERTED)
    {
      value = COMP_CSR_POL;
      regval |= value;
    }

  /* Configure COMPx hysteresis */

  switch (priv->hyst)
    {
      case COMP_HYST_DIS:
      case COMP_HYST_10MV:
      case COMP_HYST_20MV:
      case COMP_HYST_30MV:
      case COMP_HYST_40MV:
      case COMP_HYST_50MV:
      case COMP_HYST_60MV:
      case COMP_HYST_70MV:

        value = priv->hyst << COMP_CSR_HYST_SHIFT;
        regval |= value;
        break;

      default:
        return -EINVAL;
    }

  /* Configure COMPx blanking signal source */

  switch (priv->blanking)
    {
      case COMP_BLANKING_DIS:
      case COMP_BLANKING_TIMX_OCY_1:
      case COMP_BLANKING_TIMX_OCY_2:
      case COMP_BLANKING_TIMX_OCY_3:
      case COMP_BLANKING_TIMX_OCY_4:
      case COMP_BLANKING_TIMX_OCY_5:
      case COMP_BLANKING_TIMX_OCY_6:
      case COMP_BLANKING_TIMX_OCY_7:

        value = priv->blanking << COMP_CSR_BLANKING_SHIFT;
        regval |= value;
        break;

      default:
        return -EINVAL;
    }

  /* Set Comparator output selection */

