apache/nuttx/arch/arm/src/common/stm32/stm32_comp_m3m4_v2.c
#if defined(COMP_OUT_GPIO)
  comp_config_outpin(priv);
#endif

  /* Save CSR register */

  comp_putreg_csr(priv, regval);

#ifndef CONFIG_STM32_COMP_INIT_DISABLED
  /* Enable Comparator */

  comp_enable(priv, true);

  /* Lock Comparator if needed */

  if (priv->lock)
    {
      comp_lock_set(priv, true);
    }
#endif

  return OK;
}

/****************************************************************************
 * Name: comp_enable
 *
 * Description:
 *   Enable/disable comparator
 *
 * Input Parameters:
 *   priv   - A reference to the COMP structure
 *   enable - enable/disable flag
 *
 * Returned Value:
 *  0 on success, a negated errno value on failure
 *
 ****************************************************************************/

static int comp_enable(struct stm32_comp_s *priv, bool enable)
{
  bool lock;

  ainfo("enable: %d\n", enable ? 1 : 0);

  lock = comp_lock_get(priv);

  if (lock)
    {
      aerr("ERROR: Comparator locked!\n");

      return -EPERM;
    }
  else
    {
      if (enable)
        {
          /* Enable the COMP */

          comp_modify_csr(priv, 0, COMP_CSR_COMPEN);
        }
      else
        {
          /* Disable the COMP */

          comp_modify_csr(priv, COMP_CSR_COMPEN, 0);
        }
    }

  return OK;
}

/****************************************************************************
 * Name: comp_setup
 *
 * Description:
 *   Configure the COMP. This method is called the first time that the COMP
 *   device is opened. This will occur when the port is first opened. This
 *   setup includes configuring and attaching COMP interrupts.
 *   Interrupts are all disabled upon return.
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

#ifdef CONFIG_COMP
static int comp_setup(struct comp_dev_s *dev)
{
#warning "Missing logic"

  return OK;
}
#endif

/****************************************************************************
 * Name: comp_shutdown
 *
 * Description:
 *   Disable the COMP. This method is called when the COMP device is closed.
 *   This method reverses the operation the setup method.
 *   Works only if COMP device is not locked.
 *
 * Input Parameters:
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_COMP
static void comp_shutdown(struct comp_dev_s *dev)
{
#  warning "Missing logic"
}
#endif

/****************************************************************************
 * Name: comp_read
 *
 * Description:
 *  Get the COMP output state.
 *
 * Input Parameters:
 *
 * Returned Value:
 *   0 if output is low (non-inverting input below inverting input),
 *   1 if output is high (non inverting input above inverting input).
 *
 ****************************************************************************/

#ifdef CONFIG_COMP
static int comp_read(struct comp_dev_s *dev)
{
  struct stm32_comp_s *priv;
  uint32_t regval;

  priv = dev->ad_priv;
  regval = comp_getreg_csr(priv);

  return (((regval & COMP_CSR_VALUE) == 0) ? 0 : 1);
}
#endif

/****************************************************************************
 * Name: comp_ioctl
 *
 * Description:
 *   All ioctl calls will be routed through this method.
 *
 * Input Parameters:
 *   dev - pointer to device structure used by the driver
 *   cmd - command
 *   arg - arguments passed with command
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure.
 *
 ****************************************************************************/

#ifdef CONFIG_COMP
static int comp_ioctl(struct comp_dev_s *dev, int cmd, unsigned long arg)
{
  FAR struct stm32_comp_s *priv = (FAR struct stm32_comp_s *)dev->ad_priv;
  int ret = OK;

  switch (cmd)
    {
      case ANIOC_COMP_ENABLE:
        {
          /* Enable comparator */

          comp_enable(priv, true);
          break;
        }

      case ANIOC_COMP_DISABLE:
        {
          /* Disable comparator */

          comp_enable(priv, false);
          break;
        }

      default:
        {
          aerr("ERROR: Unknown cmd: %d\n", cmd);
          ret = -ENOTTY;
          break;
        }
    }

  return ret;
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_compinitialize
 *
 * Description:
 *   Initialize the COMP.
 *
 * Input Parameters:
 *   intf - The COMP interface number.
 *
 * Returned Value:
 *   Valid COMP device structure reference on success; a NULL on failure.
 *
 * Assumptions:
 *   1. Clock to the COMP block has enabled,
 *   2. Board-specific logic has already configured
 *
 ****************************************************************************/

struct comp_dev_s *stm32_compinitialize(int intf)
{
  struct comp_dev_s   *dev;
  struct stm32_comp_s *comp;
  int ret;

  switch (intf)
    {
#ifdef CONFIG_STM32_COMP1
      case 1:
        ainfo("COMP1 selected\n");
        dev = &g_comp1dev;
        break;
#endif

#ifdef CONFIG_STM32_COMP2
      case 2:
        ainfo("COMP2 selected\n");
        dev = &g_comp2dev;
        break;
#endif

#ifdef CONFIG_STM32_COMP3
      case 3:
        ainfo("COMP3 selected\n");
        dev = &g_comp3dev;
        break;
#endif

#ifdef CONFIG_STM32_COMP4
      case 4:
        ainfo("COMP4 selected\n");
        dev = &g_comp4dev;
        break;
#endif

#ifdef CONFIG_STM32_COMP5
      case 5:
        ainfo("COMP5 selected\n");
        dev = &g_comp5dev;
        break;
#endif

#ifdef CONFIG_STM32_COMP6
      case 6:
        ainfo("COMP6 selected\n");
        dev = &g_comp6dev;
        break;
#endif

#ifdef CONFIG_STM32_COMP7
      case 7:
        ainfo("COMP7 selected\n");
        dev = &g_comp7dev;
        break;
#endif

      default:
        aerr("ERROR: No COMP interface defined\n");
        return NULL;
    }

  /* Configure selected comparator */

  comp = dev->ad_priv;

  ret = comp_config(comp);
  if (ret < 0)
    {
      aerr("ERROR: Failed to initialize COMP%d: %d\n", intf, ret);
      return NULL;
    }

  return dev;
}

#endif /* CONFIG_STM32_COMP */
